app/controllers/avisos_controller.rb

SELECT * FROM "avisos" LIMIT 5 OFFSET 0
---
  def index
    @avisos = Aviso.paginate (:page => @page, :per_page=>5)

SELECT * FROM "avisos" WHERE ("avisos"."id" = 1)
---
  def show
    @aviso = Aviso.find(params[:id])

SELECT * FROM "avisos" WHERE ("avisos"."id" = 1)
---
  def edit
    @aviso = Aviso.find(params[:id])

INSERT INTO "avisos" ("created_at", "foto_file_size", "titulo", "updated_at", "url", "foto_file_name") VALUES('2010-02-11 15:23:01', 4820, 'MINISTERIO DE ECONOMIA Y FINANZAS', '2010-02-11 15:23:01', 'http://www.economiayfinanzas.gob.bo', 'j_header_left.png')
---
  def create
    @aviso = Aviso.new(params[:aviso])

    respond_to do |format|
      if @aviso.save

SELECT * FROM "avisos" WHERE ("avisos"."id" = 1)
---
  def update
    @aviso = Aviso.find(params[:id])

SELECT * FROM "avisos" WHERE ("avisos"."id" = 2)
DELETE FROM "avisos" WHERE "id" = 2
---
  def destroy
    @aviso = Aviso.find(params[:id])
    @aviso.destroy