app/controllers/configuracions_controller.rb

  def index
    @configuracions = Configuracion.all
---
SELECT * FROM "configuracions"