app/controllers/panels_controller.rb

  def index
    #@panels = Panel.all
    @publicacions = Publicacion.all
    @avisos = Aviso.all
---
SELECT * FROM "publicacions"
SELECT * FROM "avisos"