app/controllers/publicacions_controller.rb

  def index
    @publicacions = Publicacion.paginate (:page => @page, :per_page=>5)
---
SELECT * FROM "publicacions" LIMIT 3 OFFSET 0
SELECT count(*) AS count_all FROM "publicacions"

  def show
    @publicacion = Publicacion.find(params[:id])
---
SELECT * FROM "publicacions" WHERE ("publicacions"."id" = 1)

  def edit
    @publicacion = Publicacion.find(params[:id])
---
SELECT * FROM "publicacions" WHERE ("publicacions"."id" = 1)

  def create
    @publicacion = Publicacion.new(params[:publicacion])

    respond_to do |format|
      if @publicacion.save
---
INSERT INTO "publicacions" ("created_at", "foto_file_size", "titulo", "updated_at", "foto_file_name", "mensaje") VALUES('2010-02-11 14:40:29', 172006, 'CURSO DE RUBY ON RAILS', '2010-02-11 14:40:29', '4266169456_2bd84ae7a8_o.jpg', 'Excelente curso para q no se la pierdan!!!

  def update
    @publicacion = Publicacion.find(params[:id])

    respond_to do |format|
      if @publicacion.update_attributes(params[:publicacion])
---
SELECT * FROM "publicacions" WHERE ("publicacions"."id" = 1)
UPDATE "publicacions" SET "updated_at" = '2010-02-11 14:49:38', "titulo" = 'QUE PREFIEREN MAC O PC', "mensaje" = 'HUMOR!!!!

  def destroy
    @publicacion = Publicacion.find(params[:id])
    @publicacion.destroy
---
SELECT * FROM "publicacions" WHERE ("publicacions"."id" = 1)
DELETE FROM "publicacions" WHERE "id" = 1