app/controllers/session_controller.rb

  def create
    # Buscamos con este metodo mediante el login
    @usuario = Usuario.find_by_login(params[:usuario][:login])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."login" = 'marcol') LIMIT 1