app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT * FROM "usuarios"

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)

  def edit
    @usuario = Usuario.find(params[:id])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)

  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("apellido", "updated_at", "nombre", "cumple", "login", "tipo", "fecha_nacimiento", "pass", "created_at") VALUES(NULL, '2007-12-10 07:57:35', 'Marco Laura', NULL, 'marcol', 'admin', '2012-12-10 00:00:00', 'marcol', '2007-12-10 07:57:35')

  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)
UPDATE "usuarios" SET "updated_at" = '2010-02-11 15:56:14', "nombre" = 'Marco Antonio', "apellido" = 'Laura', "fecha_nacimiento" = '2007-10-13' WHERE "id" = 1